RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Include/gd32f5xx_can.h
/* receive data byte 0 */
#define GET_RFIFOMDATA0_DB0(regval)        GET_BITS((uint32_t)(regval), 0U, 7U)

/* receive data byte 1 */
#define GET_RFIFOMDATA0_DB1(regval)        GET_BITS((uint32_t)(regval), 8U, 15U)

/* receive data byte 2 */
#define GET_RFIFOMDATA0_DB2(regval)        GET_BITS((uint32_t)(regval), 16U, 23U)

/* receive data byte 3 */
#define GET_RFIFOMDATA0_DB3(regval)        GET_BITS((uint32_t)(regval), 24U, 31U)

/* receive data byte 4 */
#define GET_RFIFOMDATA1_DB4(regval)        GET_BITS((uint32_t)(regval), 0U, 7U)

/* receive data byte 5 */
#define GET_RFIFOMDATA1_DB5(regval)        GET_BITS((uint32_t)(regval), 8U, 15U)

/* receive data byte 6 */
#define GET_RFIFOMDATA1_DB6(regval)        GET_BITS((uint32_t)(regval), 16U, 23U)

/* receive data byte 7 */
#define GET_RFIFOMDATA1_DB7(regval)        GET_BITS((uint32_t)(regval), 24U, 31U)

/* error number */
#define GET_ERR_ERRN(regval)               GET_BITS((uint32_t)(regval), 4U, 6U)

/* transmit error count */
#define GET_ERR_TECNT(regval)              GET_BITS((uint32_t)(regval), 16U, 23U)

/* receive  error count */
#define GET_ERR_RECNT(regval)              GET_BITS((uint32_t)(regval), 24U, 31U)

/* CAN errors */
#define ERR_ERRN(regval)                   (BITS(4,6) & ((uint32_t)(regval) << 4))
#define CAN_ERRN_0                         ERR_ERRN(0U)                 /*!< no error */
#define CAN_ERRN_1                         ERR_ERRN(1U)                 /*!< fill error */
#define CAN_ERRN_2                         ERR_ERRN(2U)                 /*!< format error */
#define CAN_ERRN_3                         ERR_ERRN(3U)                 /*!< ACK error */
#define CAN_ERRN_4                         ERR_ERRN(4U)                 /*!< bit recessive error */
#define CAN_ERRN_5                         ERR_ERRN(5U)                 /*!< bit dominant error */
#define CAN_ERRN_6                         ERR_ERRN(6U)                 /*!< CRC error */
#define CAN_ERRN_7                         ERR_ERRN(7U)                 /*!< software error */

#define CAN_STATE_PENDING                  ((uint32_t)0x00000000U)      /*!< CAN pending */

/* CAN communication mode */
#define CAN_NORMAL_MODE                    ((uint8_t)0x00U)             /*!< normal communication mode */
#define CAN_LOOPBACK_MODE                  ((uint8_t)0x01U)             /*!< loopback communication mode */
#define CAN_SILENT_MODE                    ((uint8_t)0x02U)             /*!< silent communication mode */
#define CAN_SILENT_LOOPBACK_MODE           ((uint8_t)0x03U)             /*!< loopback and silent communication mode */

/* CAN resynchronisation jump width */
#define CAN_BT_SJW_1TQ                     ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_BT_SJW_2TQ                     ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_BT_SJW_3TQ                     ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_BT_SJW_4TQ                     ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_BT_SJW_5TQ                     ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_BT_SJW_6TQ                     ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_BT_SJW_7TQ                     ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_BT_SJW_8TQ                     ((uint8_t)0x07U)             /*!< 8 time quanta */
#define CAN_BT_SJW_9TQ                     ((uint8_t)0x08U)             /*!< 9 time quanta */
#define CAN_BT_SJW_10TQ                    ((uint8_t)0x09U)             /*!< 10 time quanta */
#define CAN_BT_SJW_11TQ                    ((uint8_t)0x0AU)             /*!< 11 time quanta */
#define CAN_BT_SJW_12TQ                    ((uint8_t)0x0BU)             /*!< 12 time quanta */
#define CAN_BT_SJW_13TQ                    ((uint8_t)0x0CU)             /*!< 13 time quanta */
#define CAN_BT_SJW_14TQ                    ((uint8_t)0x0DU)             /*!< 14 time quanta */
#define CAN_BT_SJW_15TQ                    ((uint8_t)0x0EU)             /*!< 15 time quanta */
#define CAN_BT_SJW_16TQ                    ((uint8_t)0x0FU)             /*!< 16 time quanta */
#define CAN_BT_SJW_17TQ                    ((uint8_t)0x10U)             /*!< 17 time quanta */
#define CAN_BT_SJW_18TQ                    ((uint8_t)0x11U)             /*!< 18 time quanta */
#define CAN_BT_SJW_19TQ                    ((uint8_t)0x12U)             /*!< 19 time quanta */
#define CAN_BT_SJW_20TQ                    ((uint8_t)0x13U)             /*!< 20 time quanta */
#define CAN_BT_SJW_21TQ                    ((uint8_t)0x14U)             /*!< 21 time quanta */
#define CAN_BT_SJW_22TQ                    ((uint8_t)0x15U)             /*!< 22 time quanta */
#define CAN_BT_SJW_23TQ                    ((uint8_t)0x16U)             /*!< 23 time quanta */
#define CAN_BT_SJW_24TQ                    ((uint8_t)0x17U)             /*!< 24 time quanta */
#define CAN_BT_SJW_25TQ                    ((uint8_t)0x18U)             /*!< 25 time quanta */
#define CAN_BT_SJW_26TQ                    ((uint8_t)0x19U)             /*!< 26 time quanta */
#define CAN_BT_SJW_27TQ                    ((uint8_t)0x1AU)             /*!< 27 time quanta */
#define CAN_BT_SJW_28TQ                    ((uint8_t)0x1BU)             /*!< 28 time quanta */
#define CAN_BT_SJW_29TQ                    ((uint8_t)0x1CU)             /*!< 29 time quanta */
#define CAN_BT_SJW_30TQ                    ((uint8_t)0x1DU)             /*!< 30 time quanta */
#define CAN_BT_SJW_31TQ                    ((uint8_t)0x1EU)             /*!< 31 time quanta */
#define CAN_BT_SJW_32TQ                    ((uint8_t)0x1FU)             /*!< 32 time quanta */

/* CAN time segment 1 */
#define CAN_BT_BS1_1TQ                     ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_BT_BS1_2TQ                     ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_BT_BS1_3TQ                     ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_BT_BS1_4TQ                     ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_BT_BS1_5TQ                     ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_BT_BS1_6TQ                     ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_BT_BS1_7TQ                     ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_BT_BS1_8TQ                     ((uint8_t)0x07U)             /*!< 8 time quanta */
#define CAN_BT_BS1_9TQ                     ((uint8_t)0x08U)             /*!< 9 time quanta */
#define CAN_BT_BS1_10TQ                    ((uint8_t)0x09U)             /*!< 10 time quanta */
#define CAN_BT_BS1_11TQ                    ((uint8_t)0x0AU)             /*!< 11 time quanta */
#define CAN_BT_BS1_12TQ                    ((uint8_t)0x0BU)             /*!< 12 time quanta */
#define CAN_BT_BS1_13TQ                    ((uint8_t)0x0CU)             /*!< 13 time quanta */
#define CAN_BT_BS1_14TQ                    ((uint8_t)0x0DU)             /*!< 14 time quanta */
#define CAN_BT_BS1_15TQ                    ((uint8_t)0x0EU)             /*!< 15 time quanta */
#define CAN_BT_BS1_16TQ                    ((uint8_t)0x0FU)             /*!< 16 time quanta */

/* CAN time segment 2 */
#define CAN_BT_BS2_1TQ                     ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_BT_BS2_2TQ                     ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_BT_BS2_3TQ                     ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_BT_BS2_4TQ                     ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_BT_BS2_5TQ                     ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_BT_BS2_6TQ                     ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_BT_BS2_7TQ                     ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_BT_BS2_8TQ                     ((uint8_t)0x07U)             /*!< 8 time quanta */
#define CAN_BT_BS2_9TQ                     ((uint8_t)0x08U)             /*!< 9 time quanta */
#define CAN_BT_BS2_10TQ                    ((uint8_t)0x09U)             /*!< 10 time quanta */
#define CAN_BT_BS2_11TQ                    ((uint8_t)0x0AU)             /*!< 11 time quanta */
#define CAN_BT_BS2_12TQ                    ((uint8_t)0x0BU)             /*!< 12 time quanta */
#define CAN_BT_BS2_13TQ                    ((uint8_t)0x0CU)             /*!< 13 time quanta */
#define CAN_BT_BS2_14TQ                    ((uint8_t)0x0DU)             /*!< 14 time quanta */
#define CAN_BT_BS2_15TQ                    ((uint8_t)0x0EU)             /*!< 15 time quanta */
#define CAN_BT_BS2_16TQ                    ((uint8_t)0x0FU)             /*!< 16 time quanta */
#define CAN_BT_BS2_17TQ                    ((uint8_t)0x10U)             /*!< 17 time quanta */
#define CAN_BT_BS2_18TQ                    ((uint8_t)0x11U)             /*!< 18 time quanta */
#define CAN_BT_BS2_19TQ                    ((uint8_t)0x12U)             /*!< 19 time quanta */
#define CAN_BT_BS2_20TQ                    ((uint8_t)0x13U)             /*!< 20 time quanta */
#define CAN_BT_BS2_21TQ                    ((uint8_t)0x14U)             /*!< 21 time quanta */
#define CAN_BT_BS2_22TQ                    ((uint8_t)0x15U)             /*!< 22 time quanta */
#define CAN_BT_BS2_23TQ                    ((uint8_t)0x16U)             /*!< 23 time quanta */
#define CAN_BT_BS2_24TQ                    ((uint8_t)0x17U)             /*!< 24 time quanta */
#define CAN_BT_BS2_25TQ                    ((uint8_t)0x18U)             /*!< 25 time quanta */
#define CAN_BT_BS2_26TQ                    ((uint8_t)0x19U)             /*!< 26 time quanta */
#define CAN_BT_BS2_27TQ                    ((uint8_t)0x1AU)             /*!< 27 time quanta */
#define CAN_BT_BS2_28TQ                    ((uint8_t)0x1BU)             /*!< 28 time quanta */
#define CAN_BT_BS2_29TQ                    ((uint8_t)0x1CU)             /*!< 29 time quanta */
#define CAN_BT_BS2_30TQ                    ((uint8_t)0x1DU)             /*!< 30 time quanta */
#define CAN_BT_BS2_31TQ                    ((uint8_t)0x1EU)             /*!< 31 time quanta */
#define CAN_BT_BS2_32TQ                    ((uint8_t)0x1FU)             /*!< 32 time quanta */

/* CAN resynchronisation jump width */
#define CAN_DBT_SWJ_1TQ                     ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_SWJ_2TQ                     ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_SWJ_3TQ                     ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_SWJ_4TQ                     ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_SWJ_5TQ                     ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_SWJ_6TQ                     ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_SWJ_7TQ                     ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_SWJ_8TQ                     ((uint8_t)0x07U)             /*!< 8 time quanta */

/* CAN mailbox number */
#define CAN_MAILBOX0                       ((uint8_t)0x00U)             /*!< mailbox0 */
#define CAN_MAILBOX1                       ((uint8_t)0x01U)             /*!< mailbox1 */
#define CAN_MAILBOX2                       ((uint8_t)0x02U)             /*!< mailbox2 */
#define CAN_NOMAILBOX                      ((uint8_t)0x03U)             /*!< no mailbox empty */

/* CAN frame format */
#define CAN_FF_STANDARD                    ((uint32_t)0x00000000U)      /*!< standard frame */
#define CAN_FF_EXTENDED                    ((uint32_t)0x00000004U)      /*!< extended frame */

/* CAN receive FIFO */
#define CAN_FIFO0                          ((uint8_t)0x00U)             /*!< receive FIFO0 */
#define CAN_FIFO1                          ((uint8_t)0x01U)             /*!< receive FIFO1 */

